app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents`
---
  def index
    @documents = Document.all

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 2 LIMIT 1
---
  def edit
    @document = Document.find(params[:id])

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 2 LIMIT 1
UPDATE `documents` SET `subject` = 'No.1のタイトルddです。', `updated_at` = '2014-12-12 08:35:51.339391' WHERE `documents`.`id` = 2
---
  def update
    @document = Document.find(params[:id])
    if @document.update_attributes document_params